In [35]:
import pandas as pd
df=pd.read_csv("titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Data Preprocessing

In [36]:

df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [37]:
target = df.Survived
inputs=df.drop('Survived',axis='columns')

In [38]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [39]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [40]:
inputs.drop('Sex',axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [41]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [42]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [43]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())
inputs.head(6)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1

In [44]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(inputs,target,test_size=0.2)

In [45]:
len(X_train)

712

In [46]:
len(X_test)

179

In [47]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [48]:
model.fit(X_train,y_train)

GaussianNB()

In [49]:
model.score(X_test,y_test)

0.8100558659217877

In [50]:
model.predict(X_test[:10])

array([0, 0, 0, 0, 0, 1, 1, 0, 0, 0], dtype=int64)

In [51]:
y_test[:10]

286    1
844    0
74     1
682    0
857    1
337    1
275    1
870    0
568    0
665    0
Name: Survived, dtype: int64

In [63]:
model.predict_proba(X_test[60:100])

array([[9.89817168e-01, 1.01828323e-02],
       [8.13438365e-02, 9.18656163e-01],
       [6.64447100e-02, 9.33555290e-01],
       [9.90107601e-01, 9.89239888e-03],
       [9.88458072e-01, 1.15419277e-02],
       [3.25424753e-03, 9.96745752e-01],
       [4.19635691e-04, 9.99580364e-01],
       [7.66425448e-02, 9.23357455e-01],
       [9.90033324e-01, 9.96667598e-03],
       [9.89751951e-01, 1.02480489e-02],
       [7.98499359e-02, 9.20150064e-01],
       [9.86490016e-01, 1.35099844e-02],
       [9.90030304e-01, 9.96969575e-03],
       [9.88226832e-01, 1.17731683e-02],
       [9.89512208e-01, 1.04877923e-02],
       [9.73752919e-01, 2.62470811e-02],
       [9.77804751e-01, 2.21952485e-02],
       [9.89753779e-01, 1.02462209e-02],
       [9.89806262e-01, 1.01937379e-02],
       [9.87542759e-01, 1.24572408e-02],
       [9.56817042e-01, 4.31829576e-02],
       [7.09073520e-02, 9.29092648e-01],
       [9.88910944e-01, 1.10890558e-02],
       [9.89808539e-01, 1.01914614e-02],
       [9.80907020e-01, 1.90929801e-02],
       [3.85994599e-02, 9.61400540e-01],
       [9.80190232e-01, 1.98097684e-02],
       [2.05151594e-01, 7.94848406e-01],
       [1.67650991e-06, 9.99998323e-01],
       [9.75155568e-01, 2.48444320e-02],
       [6.04810391e-02, 9.39518961e-01],
       [9.81239909e-01, 1.87600910e-02],
       [9.89333300e-01, 1.06666997e-02],
       [9.89115553e-01, 1.08844473e-02],
       [9.67854973e-01, 3.21450265e-02],
       [1.52986961e-04, 9.99847013e-01],
       [3.50664028e-02, 9.64933597e-01],
       [9.90033151e-01, 9.96684867e-03],
       [9.75384933e-01, 2.46150669e-02],
       [6.99768388e-12, 1.00000000e+00]])

     Pclass        Age      Fare  female  male  female  male
54        1  65.000000   61.9792       0     1       0     1
446       2  13.000000   19.5000       1     0       1     0
706       2  45.000000   13.5000       1     0       1     0
479       3   2.000000   12.2875       1     0       1     0
727       3  29.699118    7.7375       1     0       1     0
..      ...        ...       ...     ...   ...     ...   ...
228       2  18.000000   13.0000       0     1       0     1
188       3  40.000000   15.5000       0     1       0     1
454       3  29.699118    8.0500       0     1       0     1
660       1  50.000000  133.6500       0     1       0     1
156       3  16.000000    7.7333       1     0       1     0

[179 rows x 7 columns]